{
  "display-name": "PDF Craft",
  "description": "Transform PDF documents into Markdown or EPUB formats using AI-driven GPU-accelerated OCR technology for documentation and digital publishing.",
  "test-gpu-optimization-levels": "Test GPU Optimization Levels",
  "testing-workflow-for-evaluating-different-gpu-optimization-confi": "Testing workflow for evaluating different GPU optimization configurations in the PDF to Markdown conversion task. This flow is designed for benchmarking and quality assurance, allowing developers to test how various optimization levels (balanced vs quality) and GPU memory allocation settings affect conversion performance, accuracy, and resource utilization. The workflow uses a sample PDF document with footnotes enabled to test the full feature set, providing insights into processing speeds, GPU utilization patterns, and conversion quality under different optimization strategies. Useful for identifying optimal settings for specific hardware configurations or document types.",
  "pdf-to-epub": "PDF to EPUB",
  "convert-pdf-documents-to-epub-electronic-publication-format-usin": "Convert PDF documents to EPUB (Electronic Publication) format using GPU-accelerated OCR technology. This task transforms PDFs into reflowable EPUB ebooks suitable for e-readers, tablets, and mobile devices. Features include: intelligent text extraction with OCR for scanned documents, preservation of footnotes and document structure, configurable table rendering (HTML or Markdown), mathematical formula support (LaTeX to MathML conversion), customizable book metadata (title and authors), and optional analysis visualizations for quality assurance. Requires NVIDIA GPU with CUDA support. Supports multiple OCR model sizes to balance processing speed and accuracy. Ideal for digitizing academic papers, technical documentation, books, and any PDF content for enhanced reading experience on electronic devices.",
  "path-to-the-input-pdf-file-to-be-converted-the-file-must-be-a-va": "Path to the input PDF file to be converted. The file must be a valid PDF document accessible from the local filesystem. Supports any standard PDF format including scanned documents which will be processed using OCR.",
  "destination-path-where-the-converted-epub-file-will-be-saved-if": "Destination path where the converted EPUB file will be saved. If not specified, the output will be saved in the session directory with the same base name as the input PDF file. The path should include the .epub extension or it will be automatically added. The parent directory will be created if it doesn't exist.",
  "controls-whether-footnotes-in-the-pdf-document-should-be-preserv": "Controls whether footnotes in the PDF document should be preserved and included in the generated EPUB file. When enabled (true), footnotes will be extracted and properly formatted in the EPUB. When disabled (false, default), footnotes are excluded from the output. This is useful for academic or technical documents that contain extensive footnote annotations.",
  "specifies-the-ocr-optical-character-recognition-model-size-to-us": "Specifies the OCR (Optical Character Recognition) model size to use for text extraction from PDF pages. Available options: 'gundam' (balanced performance and quality), 'large' (highest quality, slowest processing), 'base' (standard quality, default, recommended for most use cases), 'small' (faster processing, lower quality), 'tiny' (fastest processing, lowest quality). Larger models provide better accuracy for complex layouts and low-quality scans but require more GPU memory and processing time.",
  "sets-the-title-metadata-for-the-generated-epub-file-this-title-w": "Sets the title metadata for the generated EPUB file. This title will appear in e-reader applications and library management software. If not provided, the EPUB will be created without specific title metadata. Example: 'Introduction to Machine Learning'.",
  "specifies-the-author-s-metadata-for-the-generated-epub-file-for": "Specifies the author(s) metadata for the generated EPUB file. For multiple authors, separate names with commas (e.g., 'John Smith, Jane Doe'). This metadata will be displayed in e-reader applications and used for library organization. If not provided, the EPUB will be created without author metadata.",
  "determines-how-tables-in-the-pdf-should-be-rendered-in-the-epub": "Determines how tables in the PDF should be rendered in the EPUB output. Options: 'HTML' (default, preserves table formatting with HTML markup, recommended for complex tables with merged cells), 'Markdown' (converts tables to Markdown format, suitable for simpler tables and better readability in plain text). HTML rendering provides better visual fidelity while Markdown offers better compatibility with basic e-readers.",
  "controls-how-latex-mathematical-formulas-and-equations-should-be": "Controls how LaTeX mathematical formulas and equations should be rendered in the EPUB output. Options: 'MathML' (default, converts LaTeX to MathML format for native rendering in compatible e-readers, provides best visual quality), 'LaTeX' (preserves original LaTeX notation as text, useful for readers who prefer seeing the raw LaTeX code or when targeting editors that support LaTeX). MathML is recommended for end-user reading while LaTeX is better for technical editing.",
  "enables-or-disables-the-generation-of-analysis-visualizations-du": "Enables or disables the generation of analysis visualizations during the PDF conversion process. When enabled (true), the task will create diagnostic charts and plots showing conversion statistics, page processing times, and quality metrics. These visualizations are saved to an 'analysis' subdirectory alongside the output file. When disabled (false, default), no analysis visualizations are generated. Useful for debugging conversion issues or optimizing processing performance.",
  "absolute-file-path-to-the-successfully-generated-epub-file-this": "Absolute file path to the successfully generated EPUB file. This path points to the final output file that can be opened in any EPUB-compatible e-reader application. The file is fully formatted with the specified rendering options and metadata. Format: string representing a valid filesystem path (e.g., '/path/to/output/document.epub').",
  "pdf-to-markdown": "PDF to Markdown",
  "convert-pdf-documents-to-markdown-format-with-comprehensive-imag": "Convert PDF documents to Markdown format with comprehensive image extraction using GPU-accelerated OCR technology. This task transforms PDFs into clean, editable Markdown files with properly extracted images, making them ideal for documentation systems, static site generators (Jekyll, Hugo, MkDocs), content management platforms, and version control workflows. Key features include: advanced OCR with multiple model size options for accuracy/speed tradeoffs, automatic image extraction with organized asset management, footnote preservation with proper Markdown linking, GPU memory management for concurrent task execution, configurable optimization levels (bfloat16 or float16 precision), optional analysis visualizations showing processing metrics and quality statistics, and packaged ZIP output containing both Markdown and assets for easy distribution. Requires NVIDIA GPU with CUDA support. Optimized for modern RTX GPUs with TensorFloat-32 acceleration. Perfect for converting academic papers, technical manuals, books, research documents, and legacy PDFs into modern Markdown-based workflows. Outputs are fully compatible with Git, GitHub, GitLab, and all standard Markdown processors.",
  "path-to-the-input-pdf-file-to-be-converted-to-markdown-the-file": "Path to the input PDF file to be converted to Markdown. The file must be a valid PDF document accessible from the local filesystem. Supports all standard PDF formats including text-based PDFs and scanned documents (processed via OCR). The system will automatically handle both digital and scanned content.",
  "destination-path-where-the-converted-markdown-file-will-be-saved": "Destination path where the converted Markdown file will be saved. If not specified, the output will be saved in the session directory with the same base name as the input PDF. The path should include the .md extension or it will be automatically added. The parent directory will be created automatically if it doesn't exist. A corresponding 'images' subdirectory will be created for extracted image assets.",
  "controls-whether-footnotes-in-the-pdf-document-should-be-preserv2": "Controls whether footnotes in the PDF document should be preserved and included in the generated Markdown file. When enabled (true), footnotes will be extracted and formatted as Markdown footnotes with proper linking. When disabled (false, default), footnotes are excluded from the output. Essential for academic papers, research documents, and technical books that rely on footnote citations and annotations.",
  "specifies-the-ocr-optical-character-recognition-model-size-for-t": "Specifies the OCR (Optical Character Recognition) model size for text extraction. Available options in order of quality: 'large' (highest quality, slowest, best for complex layouts and poor-quality scans), 'base' (standard quality, default, recommended for most documents), 'gundam' (balanced performance and quality, good middle ground), 'small' (faster processing, suitable for simple layouts and good quality scans), 'tiny' (fastest processing, lowest quality, only for high-quality documents). Larger models require more GPU memory (approximately 8-12GB VRAM for 'large') and processing time but provide superior accuracy for challenging documents with complex layouts, mathematical formulas, or low resolution.",
  "enables-or-disables-the-generation-of-analysis-visualizations-an": "Enables or disables the generation of analysis visualizations and diagnostic plots during the PDF conversion process. When enabled (true), the task creates comprehensive charts showing: page processing times, OCR confidence scores, GPU utilization metrics, memory usage, and conversion quality statistics. These visualizations are saved to an 'analysis' subdirectory alongside the output file in PNG format. When disabled (false, default), no analysis visualizations are generated, reducing processing overhead. Highly recommended for troubleshooting conversion issues, optimizing performance for batch processing, or quality validation of converted documents.",
  "controls-the-gpu-inference-optimization-strategy-for-ocr-process": "Controls the GPU inference optimization strategy for OCR processing. Available options: 'balanced' (bfloat16 precision, default, recommended for most GPUs, provides optimal balance between speed and accuracy with better numerical stability), 'quality' (float16 precision, more conservative approach, slightly higher accuracy for specific models but may be slower). The 'balanced' mode leverages bfloat16 tensor operations which are optimized on modern NVIDIA GPUs (RTX 30/40 series) and provide faster computation while maintaining excellent quality. Choose 'quality' only if you observe accuracy issues with the default setting.",
  "specifies-the-maximum-fraction-of-gpu-memory-that-can-be-utilize": "Specifies the maximum fraction of GPU memory that can be utilized for OCR processing. Valid range: 0.1 (10%) to 1.0 (100%), default: 0.9 (90%). Lower values (0.5-0.7) leave memory available for other concurrent tasks or applications, useful in shared GPU environments or when running multiple OOMOL tasks simultaneously. Higher values (0.85-0.95) maximize performance for dedicated processing but may cause out-of-memory errors if other GPU applications are running. The system will automatically manage memory within this limit, preventing allocation failures. Example: 0.7 reserves 30% GPU memory for other processes while using 70% for conversion.",
  "absolute-file-path-to-a-zip-archive-containing-the-complete-conv": "Absolute file path to a ZIP archive containing the complete conversion output. The archive includes: (1) the primary Markdown file with formatted text, headers, lists, tables, and formula references, (2) an 'images' directory with all extracted images in their original quality and format (PNG, JPEG, etc.), maintaining proper file organization and references from the Markdown content. This packaged format ensures all assets remain together and relative links in the Markdown file work correctly when extracted. Format: string representing a valid filesystem path (e.g., '/path/to/output/document.zip'). Users can extract the ZIP to obtain a self-contained Markdown document with all associated assets."
}
